In [2]:
import pandas as pd

In [3]:
import pandas as pd

data = {
'Shop_Name': ['Starbucks', 'Blue Bottle', 'Dunkin', 'Peets', 'Starbucks', 'La Colombe', 'Blue Bottle', 'Peets', 'Starbucks', 'Dunkin'],
'Location': ['Hollywood', 'San Diego', 'San Diego', 'Hollywood', 'New York', 'New York', 'Hollywood', 'San Diego', 'New York', 'Hollywood'],
'Rating': [4.5, 4.7, 4.1, 4.3, 4.5, 4.8, 4.6, 4.2, 4.4, 3.9],
'Type': ['Chain', 'Independent', 'Chain', 'Chain', 'Chain', 'Independent', 'Independent', 'Chain', 'Chain', 'Chain']
}

coffee_shops = pd.DataFrame(data)

In [4]:
coffee_shops

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

#### How would you group the data by the Location column and retrieve the first entry for each group?

In [5]:
coffee_shops.groupby(by='Location').head(1)

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
4    Starbucks   New York     4.5        Chain

#### Group the data by the Type column. How many entries are there for each type of coffee shop?

In [6]:
coffee_shops.groupby('Type').agg({'Shop_Name':'count'})

             Shop_Name
Type
Chain                7
Independent          3

#### By grouping data by the Shop_Name column, can you find the average rating for each shop?

In [7]:
coffee_shops.groupby('Shop_Name').agg({'Rating':'mean'})

               Rating
Shop_Name
Blue Bottle  4.650000
Dunkin       4.000000
La Colombe   4.800000
Peets        4.250000
Starbucks    4.466667

#### Group the data by both Location and Type. How many 'Chain' coffee shops are there in 'Hollywood'?

In [8]:
df = coffee_shops.groupby(['Location', 'Type']).count()

In [9]:
df.loc[('Hollywood',       'Chain')][0]

3

#### If you group the data by Location, which location has the highest average rating?

In [10]:
rating_in_order = coffee_shops.groupby('Location').agg({'Rating':'mean'}).sort_values('Rating', ascending=False)

In [11]:
rating_in_order

             Rating
Location
New York   4.566667
San Diego  4.333333
Hollywood  4.325000

In [12]:
rating_in_order.iloc[0].name

'New York'

#### Group the data by Shop_Name. Which shop appears most frequently in the dataset?

In [13]:
coffee_shops

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

In [20]:
coffee_shops.groupby('Shop_Name').count().sort_values('Location', ascending=False).iloc[0].name

'Starbucks'

#### After grouping the data by the Type column, what's the maximum rating a 'Chain' coffee shop has received?

In [24]:
coffee_shops.groupby('Type').max('Rating').loc['Chain']

Rating    4.5
Name: Chain, dtype: float64

#### If you group the data by the Location column, can you determine the range (difference between max and min) of ratings for shops in 'San Diego'?

In [61]:
def calc_range(df_group):
    return df_group.astype(float).max() - df_group.astype(float).min()

In [67]:
coffee_shops.groupby('Location').agg({'Rating': lambda x : calc_range(x)}).loc['San Diego']

Rating    0.6
Name: San Diego, dtype: float64

#### Group the dataset by Shop_Name. Which shop has the lowest average rating?

In [80]:
avg_ratings = coffee_shops.groupby('Shop_Name').agg({'Rating': 'mean'})

In [81]:
avg_ratings

               Rating
Shop_Name
Blue Bottle  4.650000
Dunkin       4.000000
La Colombe   4.800000
Peets        4.250000
Starbucks    4.466667

In [82]:
avg_ratings['Rating'].idxmin()

'Dunkin'

#### By grouping the data based on Location, can you find the sum of ratings for each location?

In [83]:
coffee_shops.groupby('Location').agg({'Rating':'sum'})

           Rating
Location
Hollywood    17.3
New York     13.7
San Diego    13.0